app/controllers/devices_controller.rb

INSERT INTO `devicetypes` (`name`, `created_at`, `updated_at`, `description`) VALUES('交换机', '2010-05-10 13:44:58', '2010-05-10 13:44:58', '<p>\r\n	CISCO交换机系列</p>\r\n')
---
  def new_devicetype
    @devicetype = Devicetype.new(params[:devicetype])
    if request.post? and @devicetype.save